Repository: Vazul25/PiCha-Git
Catalog: PiChatAngular2/PiChat.Bll/Resources/Resources.*.resx
Languages: hu

# acc
source: Accept
hu: Elfogad

# act
source: Actions
hu: Akciók

# act1
source: Action
hu: Akció

source: All
hu: Összes

# brw
source: Browse...
hu: Válassz...

# can
source: Cancel
hu: Mégse

# canall
source: Cancel all
hu: Mindent vissza

# cdes
source: Change Description
hu: Leíráscsere

# cgd
source: Change group description
hu: Csoport leírás változtatás

# cgn
source: Change group name
hu: Csoportnév változtatás

# cid
source: Change image description
hu: Képleírás változtatás

# cl
source: Clear
hu: Törlés

# cname
source: Change Name
hu: Névváltoztatás

# cng
source: Create new group
hu: Új csoport létrehozás

# cpass
source: Change Password
hu: Jelszóváltoztatás

# cpic
source: Change picture
hu: Képváltoztatás

# cr
source: Create
hu: Kész

# cur
source: Current password
hu: Jelenlegi jelszó

# cyn
source: Change your name
hu: Változtasd meg a neved

# cyp
source: Change your password
hu: Változtasd meg a jelszavad

# del
source: Delete
hu: Törlés

# desc
source: Description
hu: Leírás

# err
source: Error
hu: Hiba

# err1
source: Join Error
hu: Csatlakozási hiba

# err2
source: Leave Error
hu: Elhagyási hiba

# err3
source: Accept request error
hu: Elfogadási kérelem hiba

# err4
source: Reject request error
hu: Visszautasítási kérelem hiba

# err5
source: Group delete error
hu: Csoport törlési hiba

# err6
source: Server error
hu: Szerver hiba

# err7
source: Image delete error
hu: Kép törlési hiba

# err8
source: Admin grant failed
hu: Admin jogok adása meghiúsult

# error
source: Something went wrong!
hu: Valami hiba van!

# errX
source: Sorry, the operation couldn't be executed.
hu: Sajnáljuk, a műveletet nem tudtuk végrehajtani.

# errY
source: Please refresh the page or try again later.
hu: Kérlek frissítsd az oldalt, vagy próbáld meg később.

# errZ
source: You either don't have authority or there is a problem with the server, refresh page and try again
hu: Vagy nincs jogosultságod, vagy szerver probléma van, kérlek frissítsd az oldalt és kezd újra.

# ferr1
source: Upload Error
hu: Feltöltési hiba

# ferr2
source: Please select files (less than 100MB), or try again later
hu: Kérlek válassz fájlokat (kevesebb, mint 100MB), vagy kezd újra később.

# fil
source: Search
hu: Keresés

# fl
source: Files:
hu: Fájlok:

# fresh
source: Refresh
hu: Frissítés

# gerr1
source: Wrong Group Selected
hu: Rossz csoportot választottál

# gerr2
source: Please select an existing group
hu: Kérlek válassz egy létező csoportot!

# gerr3
source: Wrong group
hu: Rossz csoport

# gr
source: Group
hu: Csoport

# grp
source: Groups
hu: Csoportok

# grpnm
source: Group Name
hu: Csoportnév

# hom
source: Home
hu: Haza

# img
source: Images
hu: Képek

# imgs
source: Image size
hu: Képméret

# jreq
source: Join Requests
hu: Csatlakozási kérelmek

# lg
source: Large
hu: Nagy

source: Login
hu: Belépés

# logmsg
source: If you don't have an account, click here to register.
hu: Ha nincs fiókod, akkor kattints ide a regisztrációhoz.

source: Logout
hu: Kilépés

# md
source: Medium
hu: Közepes

# mem
source: Members
hu: Tagok

# more
source: Show More
hu: Többet

# msg1
source: You have no groups or subscribes.
hu: Nincsenek csoportjaid vagy feliratkozásaid.

# msg10
source: The password could not be changed
hu: A jelszó nem tudott megváltozni

# msg11
source: The name could not be changed
hu: A név nem tudott megváltozni

# msg2
source: You have reached the end of the line, ain't no more groups.
hu: Elérted a sor végét, nincs több csoport.

# msg3
source: There are no groups for the requested filter.
hu: Nincs keresésnek megfelelő csoport.

# msg4
source: There isn't a group where you didn't subscribe to.
hu: Nincs olyan csoport, amelyre ne iratkoztál volna fel.

# msg5
source: You have reached the end of the line, ain't no more images.
hu: Elérted a sor végét, nincs több kép.

# msg6
source: No images in the group.
hu: Nincsenek képek ebben a csoportban.

# msg7
source: The Image description could not be changed.
hu: A kép definíciója nem tudott megváltozni.

# msg8
source: Group name couldn't be changed
hu: Csoportnév nem tudott megváltozni

# msg9
source: The group couldn't be created
hu: A csoport nem tudott létrejönni

# myg
source: My groups
hu: Csoportjaim

source: Name
hu: Név

# nd
source: New description
hu: Új leírás

# nn
source: New name
hu: Új név

# npass
source: New password
hu: Új jelszó

# npconf
source: New password confirm
hu: Új jelszó még egyszer

# ogrp
source: Owned and Administrated Groups
hu: Saját és adminisztrált csoportjaim

# ok1
source: Got it!
hu: Értettem!

# opass
source: Old password
hu: Régi jelszó

# oth
source: Other groups
hu: Más csoportok

# owrnm
source: Owner Name
hu: Tulajdonosnév

# pass
source: Password
hu: Jelszó

# passc
source: Password Confirm
hu: Jelszó még egyszer

# pen
source: Pending...
hu: Függőben...

# pic
source: Pictures
hu: Képek

# pic1
source: Picture
hu: Kép

# pop1
source: A popup dialog could not open, refresh the page
hu: Egy felugró ablak nem jött fel, kérlek frissítsd az oldalt.

# pop2
source: Popup error
hu: Felugró ablak hiba

source: Preview
hu: Előnézet

# priv
source: Private
hu: Privát

# prof
source: Profile
hu: Profil

# profp
source: Profile page
hu: Profil oldal

# prog
source: Progress
hu: Folyamatban

# prom
source: Promote
hu: Előléptetés

# que1
source: Are you sure?
hu: Biztos?

# que2
source: This image will be deleted permanently.
hu: A kép véglegesen törlődik.

# que3
source: Delete Image
hu: Képtörlés

# que4
source: Yes
hu: Igen

# que5
source: No
hu: Nem

# que6
source: This group and all of it's images will be deleted permanently.
hu: A csoport és az összes benne lévő kép véglegesen törlődik.

# que7
source: Delete group
hu: Csoporttörlés

# quel
source: Queue length
hu: Sor hossz

# quepr
source: Queue upload progress
hu: Sor feltöltés folyamat

# reg
source: Register
hu: Regisztráció

# regerr1
source: Email is in use
hu: Email használatban van

# regerr2
source: Wrong email adress
hu: Rossz email cím

# regmsg
source: If you already have an account, click here to login.
hu: Ha már van fiókod, akkor kattints ide a bejelentkezéshez.

# rej
source: Reject
hu: Elutasít

# rem
source: Remove
hu: Eltávolítás

# remall
source: Remove all
hu: Mindent eltávolít

# ren
source: Rename
hu: Átnevezés

# req
source: Required.
hu: Kötelező.

# sav
source: Save
hu: Mentés

# sel
source: Select and upload new pictures
hu: Válassz ki és tölts fel új képeket

# selgr
source: Select group
hu: Válassz csoportot

# sm
source: Small
hu: Kicsi

# stat
source: Status
hu: Állapot

# sub
source: Subscribe
hu: Feliratkozás

# suc1
source: Success
hu: Siker

# suc10
source: Group deleted successfully!
hu: A csoport sikeresen törlődött!

# suc11
source: Request accepted!
hu: A kérés elfogadva!

# suc12
source: Request rejected!
hu: A kérés elutasítva!

# suc13
source: Successful registration!
hu: Sikeres regisztráció!

# suc14
source: Please log in to continue!
hu: Kérlek jelentkezz be a folytatáshoz!

# suc2
source: Your files uploaded successfully
hu: A fájlaid sikeresen fel lettek töltve.

# suc3
source: Image deleted successfully!
hu: A kép sikeresen törlődött!

# suc4
source: Image description changed successfully!
hu: A képleírás sikeresen megváltozott!

# suc5
source: Your name successfully changed to '
hu: A neved sikeresen megváltozott erre: '

# suc6
source: Your password successfully changed!
hu: A jelszavad sikeresen megváltozott!

# suc7
source: Group created with name '
hu: A csoport létrejött ezzel a névvel: '

# suc8
source: Group renamed successfully to '
hu: A csoportot sikeresen átnevezted erre: '

# suc9
source: Group description successfully changed to '
hu: A csoportleírás sikeresen megváltozott erre: '

# sz
source: Size
hu: Méret

# treq
source: This is required.
hu: Ez kötelező.

# typgr
source: Type a group here
hu: Írj be egy csoportot

# uns
source: Unsubscribe
hu: Leiratkozás

# upall
source: Upload all
hu: Mindent feltölt

# upl
source: Upload
hu: Feltöltés

# upl1
source: Drag files here to upload
hu: Húzz ide fájlokat a feltöltéshez

# upli
source: Upload images
hu: Képfeltöltés

# uplqu
source: Upload queue
hu: Feltöltési sor

# val1
source: Your email must be a valid email address.
hu: Az email címednek a megfelelő formátumúnak kell lennie.

# val2
source: Bad username or password.
hu: Rossz felhasználónév vagy jelszó.

# val3
source: The password has to be less than 32 characters long.
hu: A jelszó legfeljebb 32 karakter hosszú lehet.

# val4
source: The password has to be more than 5 characters long.
hu: A jelszónak legalább 5 karakter hosszúnak kell lennie.

# val5
source: The password must contain at least 1 small, 1 capital letter, 1 number.
hu: A jelszónak legalább egy kisbetűt, egy nagybetűt és egy számot kell tartalmaznia.

# val6
source: Passwords do not match.
hu: A jelszavak nem egyeznek.

# wel
source: Welcome
hu: Üdvözöllek,

# notValidEmail
source: It must be a valid email adress.
hu: Ez nem egy helyes email cím.

# passwordMatchError
source: The password and confirmation password must match.
hu: A jelszónak és a jelszó megerősítésnek egyeznie kell.

# sgu
source: Select a group to upload
hu: Válassz ki egy csoportot a feltöltéshez
